In [138]:
original_list = [-1,2,-3,4,-5,6,-7,8,-9,10,-11,12]
original_list.sort(key=lambda i: 0 if i == 0 else -1 / i, reverse=False)
print("Sorted",original_list)

Sorted [2, 4, 6, 8, 10, 12, -11, -9, -7, -5, -3, -1]

In [139]:
import pandas as pd
import numpy as np

In [140]:
jpdy_data = pd.read_csv("JEOPARDY_DATA.csv")
jpdy_data.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,12/31/2004,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,12/31/2004,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,12/31/2004,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona
3,4680,12/31/2004,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,12/31/2004,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams

In [141]:

jpdy_data[" Value"] = jpdy_data[" Value"].str.removeprefix("$")
jpdy_data[" Value"] = jpdy_data[" Value"].str.replace(",","")
jpdy_data[" Value"].head()

0    200
1    200
2    200
3    200
4    200
Name:  Value, dtype: object

In [142]:
jpdy_data[" Value"] = jpdy_data[" Value"].astype(float)
jpdy_data.dtypes

Show Number      int64
 Air Date       object
 Round          object
 Category       object
 Value         float64
 Question       object
 Answer         object
dtype: object

In [143]:
jpdy_data = pd.get_dummies(jpdy_data[[" Round"]])
jpdy_data

,Round_Double Jeopardy!,Round_Final Jeopardy!,Round_Jeopardy!,Round_Tiebreaker
0,False,False,True,False
1,False,False,True,False
2,False,False,True,False
3,False,False,True,False
4,False,False,True,False
...,...,...,...,...
216925,True,False,False,False
216926,True,False,False,False
216927,True,False,False,False
216928,True,False,False,False
216929,False,True,False,False